import clsx from 'clsx'
import A4 from '../components/A4'
import styles from './paper.module.scss'

export default async function Page() {
  return (
    <A4>
      <div className={styles.col}>
        <div className={styles.row}>
          <div className={clsx(styles.block)}>
            <h2>平方</h2>
            <div
              dangerouslySetInnerHTML={{
                __html: `
$$
\\begin{align*}
1^2  &= 1\\\\
2^2  &= 4\\\\
3^2  &= 9\\\\
4^2  &= 16\\\\
5^2  &= 25\\\\
6^2  &= 36\\\\
7^2  &= 49\\\\
8^2  &= 64\\\\
9^2  &= 81\\\\
10^2 &= 100\\\\
11^2 &= 121\\\\
12^2 &= 144\\\\
13^2 &= 169\\\\
14^2 &= 196\\\\
15^2 &= 225\\\\
16^2 &= 256\\\\
17^2 &= 289\\\\
18^2 &= 324\\\\
19^2 &= 361\\\\
20^2 &= 400
\\end{align*}
$$
              `,
              }}
            />
          </div>

          <div className={clsx(styles.block)}>
            <h2>立方</h2>
            <div
              dangerouslySetInnerHTML={{
                __html: `
$$
\\begin{align*}
1^3  &= 1\\\\
2^3  &= 8\\\\
3^3  &= 27\\\\
4^3  &= 64\\\\
5^3  &= 125\\\\
6^3  &= 216\\\\
7^3  &= 343\\\\
8^3  &= 512\\\\
9^3  &= 729\\\\
10^3 &= 1000\\\\
11^3 &= 1331\\\\
12^3 &= 1728\\\\
13^3 &= 2197\\\\
14^3 &= 2744\\\\
15^3 &= 3375\\\\
16^3 &= 4096\\\\
17^3 &= 4913\\\\
18^3 &= 5832\\\\
19^3 &= 6859\\\\
20^3 &= 8000
\\end{align*}
$$
              `,
              }}
            />
          </div>

          <div className={clsx(styles.block)}>
            <h2>$2^n$</h2>
            <div
              dangerouslySetInnerHTML={{
                __html: `
$$
\\begin{align*}
2^1  &= 2\\\\
2^2  &= 4\\\\
2^3  &= 8\\\\
2^4  &= 16\\\\
2^5  &= 32\\\\
2^6  &= 64\\\\
2^7  &= 128\\\\
2^8  &= 256\\\\
2^9  &= 512\\\\
2^{10} &= 1024\\\\
2^{11} &= 2048\\\\
2^{12} &= 4096\\\\
2^{13} &= 8192\\\\
2^{14} &= 16384\\\\
2^{15} &= 32768\\\\
2^{16} &= 65536\\\\
2^{17} &= 131072\\\\
2^{18} &= 262144\\\\
2^{19} &= 524288\\\\
2^{20} &= 1048576
\\end{align*}
$$
              `,
              }}
            />
          </div>

          <div className={clsx(styles.block)}>
            <h2>平方根</h2>
            <div
              dangerouslySetInnerHTML={{
                __html: `
$$
\\begin{align*}
\\sqrt{2}  &= 1.4142...\\\\
\\sqrt{3}  &= 1.7320...\\\\
\\sqrt{4}  &= 2\\\\
\\sqrt{5}  &= 2.2360...\\\\
\\sqrt{6}  &= 2.4494...\\\\
\\sqrt{7}  &= 2.6457...\\\\
\\sqrt{8}  &= 2.8284...\\\\
\\sqrt{9}  &= 3\\\\
\\sqrt{10}  &= 3.1622...\\\\
\\sqrt{11}  &= 3.3166...\\\\
\\sqrt{12}  &= 3.4641...\\\\
\\sqrt{13}  &= 3.6055...\\\\
\\sqrt{14}  &= 3.7416...\\\\
\\sqrt{15}  &= 3.8729...\\\\
\\sqrt{16}  &= 4\\\\
\\sqrt{17}  &= 4.1231...\\\\
\\sqrt{18}  &= 4.2426...\\\\
\\sqrt{19}  &= 4.3588...\\\\
\\sqrt{20}  &= 4.4721...\\\\
\\end{align*}
$$
               `,
              }}
            />
          </div>

          <div className={clsx(styles.block)}>
            <h2>立方根</h2>
            <div
              dangerouslySetInnerHTML={{
                __html: `
$$
\\begin{align*}
\\sqrt[3]{2}  &= 1.2599...\\\\
\\sqrt[3]{3}  &= 1.4422...\\\\
\\sqrt[3]{4}  &= 1.5874...\\\\
\\sqrt[3]{5}  &= 1.7099...\\\\
\\sqrt[3]{6}  &= 1.8171...\\\\
\\sqrt[3]{7}  &= 1.9129...\\\\
\\sqrt[3]{8}  &= 2\\\\
\\sqrt[3]{9}  &= 2.0800...\\\\
\\sqrt[3]{10}  &= 2.1544...\\\\
\\sqrt[3]{11}  &= 2.2239...\\\\
\\sqrt[3]{12}  &= 2.2894...\\\\
\\sqrt[3]{13}  &= 2.3513...\\\\
\\sqrt[3]{14}  &= 2.4101...\\\\
\\sqrt[3]{15}  &= 2.4662...\\\\
\\sqrt[3]{16}  &= 2.5198...\\\\
\\sqrt[3]{17}  &= 2.5712...\\\\
\\sqrt[3]{18}  &= 2.6207...\\\\
\\sqrt[3]{19}  &= 2.6684...\\\\
\\sqrt[3]{20}  &= 2.7144...\\\\
\\end{align*}
$$
               `,
              }}
            />
          </div>
        </div>

        <div className={styles.row}>
          <div className={clsx(styles.block)}>
            <h2>$n\pi$</h2>
            <div
              dangerouslySetInnerHTML={{
                __html: `
$$
\\begin{align*}
\\pi  &= 3.1415...\\\\
2\\pi  &= 6.2831...\\\\
3\\pi  &= 9.4247...\\\\
4\\pi  &= 12.5663...\\\\
5\\pi  &= 15.7079...\\\\
6\\pi  &= 18.8495...\\\\
7\\pi  &= 21.9911...\\\\
8\\pi  &= 25.1327...\\\\
9\\pi  &= 28.2743...\\\\
10\\pi  &= 31.4159...\\\\
\\end{align*}
$$
                 `,
              }}
            />
          </div>

          <div className={styles.row}>
            <div className={clsx(styles.block)}>
              <h2>勾股数</h2>
              <div
                dangerouslySetInnerHTML={{
                  __html: `
$$
\\begin{align*}
3^2 + 4^2 &= 5^2\\\\
5^2 + 12^2 &= 13^2\\\\
7^2 + 24^2 &= 25^2\\\\
8^2 + 15^2 &= 17^2\\\\
9^2 + 40^2 &= 41^2\\\\
11^2 + 60^2 &= 61^2\\\\
12^2 + 35^2 &= 37^2\\\\
13^2 + 84^2 &= 85^2\\\\
15^2 + 112^2 &= 113^2\\\\
16^2 + 63^2 &= 65^2\\\\
\\end{align*}
$$
                `,
                }}
              />
            </div>

            <div className={clsx(styles.block)}>
              <h2>100以内质数</h2>
              <div
                dangerouslySetInnerHTML={{
                  __html: `
$$
\\begin{align*}
&2, 3, 5, 7,\\\\
&11, 13, 17, 19,\\\\
&23, 29,\\\\
&31, 37,\\\\
&41, 43, 47,\\\\
&53, 59,\\\\
&61, 67,\\\\
&71, 73, 79,\\\\
&83, 89,\\\\
&97
\\end{align*}
$$
                `,
                }}
              />
            </div>

            <div className={clsx(styles.block)}>
              <h2>多项式公式</h2>
              <div
                dangerouslySetInnerHTML={{
                  __html: `
$$
\\begin{align*}
&(a+b)^2 = a^2 + 2ab + b^2\\\\
&(a-b)^2 = a^2 - 2ab + b^2\\\\  
&(a+b)(a-b) = a^2 - b^2\\\\
&(a+b)^3=\\\\
&\\hspace{1em}a^3 + 3a^2b + 3ab^2 + b^3\\\\
&(a-b)^3=\\\\
&\\hspace{1em}a^3 - 3a^2b + 3ab^2 - b^3\\\\
&a^3+b^3=\\\\
&\\hspace{1em}(a+b)(a^2-ab+b^2)\\\\
&(a-b)^3=\\\\
&\\hspace{1em}(a-b)(a^2+ab+b^2)\\\\
\\end{align*}
$$
                `,
                }}
              />
            </div>
          </div>
        </div>
      </div>
    </A4>
  )
}
